rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    id = params[:id]
    @movie = Movie.find(id)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "title" = 'Updated Title', "director" = 'Updated Director', "release_date" = '2015-09-30 15:15:16.000000', "updated_at" = '2015-10-11 15:15:16.031541' WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Test Director'
---
  def same_director
    @movie = Movie.find(params[:id])

    if @movie.director.blank?